## Plan Result (sbox-aks)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 11 to add, 2 to change, 11 to destroy.</code></pre>

* Update
  * azurerm_resource_group.disks_resource_group
  * azurerm_resource_group.kubernetes_resource_group[1]
* Replace
  * module.kubernetes[1].azapi_resource.service_operator_credential[0]
  * module.kubernetes[1].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[1].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]
  * module.kubernetes[1].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0]
  * module.kubernetes[1].azurerm_role_assignment.genesis_managed_identity_operator[0]
  * module.kubernetes[1].azurerm_role_assignment.global_registry_acrpull[0]
  * module.kubernetes[1].azurerm_role_assignment.node_infrastructure_update_scale_set
  * module.kubernetes[1].azurerm_role_assignment.project_acrpull[0]
  * module.kubernetes[1].azurerm_role_assignment.service_operator[0]
  * module.kubernetes[1].azurerm_role_assignment.uami_rg_identity_operator[0]
  * module.kubernetes[1].azurerm_role_assignment.update_checker[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.disks_resource_group will be updated in-place
  ~ resource "azurerm_resource_group" "disks_resource_group" {
        id       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/disks-sbox-rg"
        name     = "disks-sbox-rg"
      ~ tags     = {
          + "expiresAfter" = "3000-01-01"
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_resource_group.kubernetes_resource_group[1] will be updated in-place
  ~ resource "azurerm_resource_group" "kubernetes_resource_group" {
        id       = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-rg"
        name     = "cft-sbox-01-rg"
      ~ tags     = {
          + "expiresAfter" = "3000-01-01"
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.kubernetes[1].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes[1].data.azurerm_key_vault.hmcts_access_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "hmcts_access_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "cb72ab7b703b0f2c6a1bbkv"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "azure-control-sbox-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes[1].data.azurerm_key_vault_secret.aks_admin_group_id will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "aks_admin_group_id" {
      + content_type            = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "aks-admin-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes[1].data.azurerm_key_vault_secret.kubernetes_cluster_client_secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "kubernetes_cluster_client_secret" {
      + content_type            = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes[1].data.azurerm_resource_group.disks_resource_group will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "disks_resource_group" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "disks-sbox-rg"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes[1].data.azurerm_resource_group.genesis_rg will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "genesis_rg" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "genesis-rg"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes[1].data.azurerm_resource_group.global_acr[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "global_acr" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "rpe-acr-prod-rg"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes[1].data.azurerm_resource_group.managed-identity-operator will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "managed-identity-operator" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "managed-identities-sbox-rg"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes[1].data.azurerm_resource_group.project_acr[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "project_acr" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = "cnp-acr-rg"
      + tags     = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes[1].data.azurerm_role_definition.builtin_role_definition will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_role_definition" "builtin_role_definition" {
      + assignable_scopes  = (known after apply)
      + description        = (known after apply)
      + id                 = (known after apply)
      + name               = "Contributor"
      + permissions        = (known after apply)
      + role_definition_id = (known after apply)
      + scope              = (known after apply)
      + type               = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes[1].data.azurerm_subnet.aks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subnet" "aks" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = (known after apply)
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "aks-01"
      + network_security_group_id                      = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "cft-sbox-network-rg"
      + route_table_id                                 = (known after apply)
      + service_endpoints                              = (known after apply)
      + virtual_network_name                           = "cft-sbox-vnet"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes[1].data.azurerm_subscription.subscription will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "subscription" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes[1].data.azurerm_user_assigned_identity.aks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_user_assigned_identity" "aks" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "aks-sbox-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "genesis-rg"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.kubernetes[1].azapi_resource.service_operator_credential[0] must be replaced
-/+ resource "azapi_resource" "service_operator_credential" {
      ~ body                      = jsonencode(
            {
              - properties = {
                  - audiences = [
                      - "api://AzureADTokenExchange",
                    ]
                  - issuer    = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/8243bdda-61c1-415c-b8a2-685a3b229edc/"
                  - subject   = "system:serviceaccount:azureserviceoperator-system:azureserviceoperator-default"
                }
            }
        ) -> (known after apply)
      ~ id                        = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-sbox-mi/federatedIdentityCredentials/cft-sbox-01-aks" -> (known after apply)
      + location                  = "uksouth"
        name                      = "cft-sbox-01-aks"
      ~ output                    = jsonencode({}) -> (known after apply)
      ~ parent_id                 = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-sbox-mi" -> (known after apply) # forces replacement
      ~ tags                      = {} -> (known after apply)
        # (4 unchanged attributes hidden)

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.kubernetes[1].azurerm_kubernetes_cluster.kubernetes_cluster must be replaced
-/+ resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      - disk_encryption_set_id              = "" -> null
      - dns_prefix_private_cluster          = "" -> null
      - edge_zone                           = "" -> null
      - enable_pod_security_policy          = false -> null
      ~ fqdn                                = "k8s-cft-sbox-aks-2b771b90.hcp.uksouth.azmk8s.io" -> (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      ~ id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-01-aks" -> (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      ~ kube_admin_config                   = (sensitive value)
      ~ kube_admin_config_raw               = (sensitive value)
      ~ kube_config                         = (sensitive value)
      ~ kube_config_raw                     = (sensitive value)
      - local_account_disabled              = false -> null
        name                                = "cft-sbox-01-aks"
      ~ oidc_issuer_url                     = "https://uksouth.oic.prod-aks.azure.com/531ff96d-0ae9-462a-8d2d-bec7c0b42082/8243bdda-61c1-415c-b8a2-685a3b229edc/" -> (known after apply)
      ~ portal_fqdn                         = "k8s-cft-sbox-aks-2b771b90.portal.hcp.uksouth.azmk8s.io" -> (known after apply)
      + private_dns_zone_id                 = (known after apply)
      ~ private_fqdn                        = "" -> (known after apply)
      ~ tags                                = {
          ~ "environment"  = "Sandbox" -> "sandbox"
          + "expiresAfter" = "3000-01-01"
            # (4 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)

      ~ auto_scaler_profile {
          ~ balance_similar_node_groups      = false -> (known after apply)
          ~ empty_bulk_delete_max            = "10" -> (known after apply)
          ~ expander                         = "random" -> (known after apply)
          ~ max_graceful_termination_sec     = "600" -> (known after apply)
          ~ max_node_provisioning_time       = "15m" -> (known after apply)
          ~ max_unready_nodes                = 3 -> (known after apply)
          ~ max_unready_percentage           = 45 -> (known after apply)
          ~ new_pod_scale_up_delay           = "0s" -> (known after apply)
          ~ scale_down_delay_after_add       = "10m" -> (known after apply)
          ~ scale_down_delay_after_delete    = "10s" -> (known after apply)
          ~ scale_down_delay_after_failure   = "3m" -> (known after apply)
          ~ scale_down_unneeded              = "10m" -> (known after apply)
          ~ scale_down_unready               = "20m" -> (known after apply)
          ~ scale_down_utilization_threshold = "0.5" -> (known after apply)
          ~ scan_interval                    = "10s" -> (known after apply)
          ~ skip_nodes_with_local_storage    = false -> (known after apply)
          ~ skip_nodes_with_system_pods      = true -> (known after apply)
        }

      ~ azure_active_directory_role_based_access_control {
          ~ admin_group_object_ids = [
              - "a6ce5b32-e0a5-419e-ba5c-67863c975941",
              - (sensitive value),
            ] -> (known after apply)
          - client_app_id          = "" -> null
          - server_app_id          = "" -> null
          - server_app_secret      = (sensitive value)
          ~ tenant_id              = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ default_node_pool {
          - custom_ca_trust_enabled      = false -> null
          - enable_host_encryption       = false -> null
          - enable_node_public_ip        = false -> null
          - fips_enabled                 = false -> null
          ~ kubelet_disk_type            = "OS" -> (known after apply)
            name                         = "system"
          ~ node_count                   = 2 -> (known after apply)
          ~ node_labels                  = {} -> (known after apply)
          - node_taints                  = [] -> null
          ~ os_sku                       = "Ubuntu" -> (known after apply)
          ~ tags                         = {
              + "expiresAfter" = "3000-01-01"
                # (5 unchanged elements hidden)
            }
          ~ vnet_subnet_id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet/subnets/aks-01" -> (known after apply) # forces replacement
          + workload_runtime             = (known after apply)
            # (13 unchanged attributes hidden)
        }

      ~ identity {
          ~ identity_ids = [
              - "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-sbox-mi",
            ] -> (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ kubelet_identity {
          ~ client_id                 = "f84fe47b-6010-4186-a315-27ad570b523d" -> (known after apply)
          ~ object_id                 = "ebd84b84-d1d9-496d-9b29-95068ba77163" -> (known after apply)
          ~ user_assigned_identity_id = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-aks-node-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/cft-sbox-01-aks-agentpool" -> (known after apply)
        }

      ~ network_profile {
          ~ dns_service_ip     = "10.0.0.10" -> (known after apply)
          ~ docker_bridge_cidr = "172.17.0.1/16" -> (known after apply)
          ~ ip_versions        = [
              - "IPv4",
            ] -> (known after apply)
          + network_mode       = (known after apply)
          + network_policy     = (known after apply)
          + pod_cidr           = (known after apply)
          ~ pod_cidrs          = [] -> (known after apply)
          ~ service_cidr       = "10.0.0.0/16" -> (known after apply)
          ~ service_cidrs      = [
              - "10.0.0.0/16",
            ] -> (known after apply)
            # (3 unchanged attributes hidden)

          ~ load_balancer_profile {
              ~ effective_outbound_ips      = [
                  - "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-aks-node-rg/providers/Microsoft.Network/publicIPAddresses/024cb21c-01dd-4636-8644-b86b4defb56a",
                ] -> (known after apply)
              ~ idle_timeout_in_minutes     = 0 -> (known after apply)
              ~ managed_outbound_ip_count   = 1 -> (known after apply)
              ~ managed_outbound_ipv6_count = 0 -> (known after apply)
              ~ outbound_ip_address_ids     = [] -> (known after apply)
              ~ outbound_ip_prefix_ids      = [] -> (known after apply)
              ~ outbound_ports_allocated    = 0 -> (known after apply)
            }

          + nat_gateway_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
            }
        }

      ~ windows_profile {
          + admin_password = (sensitive value)
          ~ admin_username = "azureuser" -> (known after apply)
          + license        = (known after apply)

          + gmsa {
              + dns_server  = (known after apply)
              + root_domain = (known after apply)
            }
        }

        # (1 unchanged block hidden)
    }

  # module.kubernetes[1].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] must be replaced
-/+ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - custom_ca_trust_enabled = false -> null
      - enable_host_encryption  = false -> null
      - enable_node_public_ip   = false -> null
      - fips_enabled            = false -> null
      ~ id                      = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-01-aks/agentPools/linux" -> (known after apply)
      ~ kubelet_disk_type       = "OS" -> (known after apply)
      ~ kubernetes_cluster_id   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-01-aks" -> (known after apply) # forces replacement
        name                    = "linux"
      ~ node_count              = 4 -> (known after apply)
      ~ node_labels             = {} -> (known after apply)
      ~ os_disk_size_gb         = 128 -> (known after apply)
      ~ os_sku                  = "Ubuntu" -> (known after apply)
      ~ tags                    = {
          + "expiresAfter" = "3000-01-01"
            # (5 unchanged elements hidden)
        }
      ~ vnet_subnet_id          = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-sbox-vnet/subnets/aks-01" -> (known after apply) # forces replacement
        # (15 unchanged attributes hidden)

      + timeouts {
          + update = "180m"
        }

        # (1 unchanged block hidden)
    }

  # module.kubernetes[1].azurerm_monitor_diagnostic_setting.kubernetes_cluster_diagnostic_setting[0] must be replaced
-/+ resource "azurerm_monitor_diagnostic_setting" "kubernetes_cluster_diagnostic_setting" {
      ~ id                         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-01-aks|DiagLogAnalytics" -> (known after apply)
        name                       = "DiagLogAnalytics"
      ~ target_resource_id         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-01-aks" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

      - log {
          - category = "cloud-controller-manager" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "cluster-autoscaler" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "cluster-autoscaler"
          + enabled  = true
        }
      - log {
          - category = "csi-azuredisk-controller" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "csi-azurefile-controller" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "csi-snapshot-controller" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "guard" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "guard"
          + enabled  = true
        }
      - log {
          - category = "kube-apiserver" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "kube-apiserver"
          + enabled  = true
        }
      - log {
          - category = "kube-audit" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "kube-audit-admin" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "kube-audit-admin"
          + enabled  = false
        }
      - log {
          - category = "kube-controller-manager" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "kube-controller-manager"
          + enabled  = true
        }
      - log {
          - category = "kube-scheduler" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "kube-scheduler"
          + enabled  = true
        }

        # (1 unchanged block hidden)
    }

  # module.kubernetes[1].azurerm_role_assignment.genesis_managed_identity_operator[0] must be replaced
-/+ resource "azurerm_role_assignment" "genesis_managed_identity_operator" {
      ~ id                               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-sbox-mi/providers/Microsoft.Authorization/roleAssignments/f49c0740-3a9b-2892-e462-ff4dcf65fd7f" -> (known after apply)
      ~ name                             = "f49c0740-3a9b-2892-e462-ff4dcf65fd7f" -> (known after apply)
      ~ principal_id                     = "ebd84b84-d1d9-496d-9b29-95068ba77163" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleDefinitions/f1a07417-d97a-45cb-824c-7a7467783830" -> (known after apply)
      ~ scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-sbox-mi" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.kubernetes[1].azurerm_role_assignment.global_registry_acrpull[0] must be replaced
-/+ resource "azurerm_role_assignment" "global_registry_acrpull" {
      ~ id                               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg/providers/Microsoft.Authorization/roleAssignments/a33c4e46-028e-38b6-3f05-831701792e46" -> (known after apply)
      ~ name                             = "a33c4e46-028e-38b6-3f05-831701792e46" -> (known after apply)
      ~ principal_id                     = "ebd84b84-d1d9-496d-9b29-95068ba77163" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> (known after apply)
      ~ scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.kubernetes[1].azurerm_role_assignment.node_infrastructure_update_scale_set must be replaced
-/+ resource "azurerm_role_assignment" "node_infrastructure_update_scale_set" {
      ~ id                               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-aks-node-rg/providers/Microsoft.Authorization/roleAssignments/d808560f-6f92-5eed-9d74-f6433b3da5ae" -> (known after apply)
      ~ name                             = "d808560f-6f92-5eed-9d74-f6433b3da5ae" -> (known after apply)
      ~ principal_id                     = "ebd84b84-d1d9-496d-9b29-95068ba77163" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleDefinitions/9980e02c-c2be-4d73-94e8-173b1dc7cf3c" -> (known after apply)
      ~ scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-aks-node-rg" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.kubernetes[1].azurerm_role_assignment.project_acrpull[0] must be replaced
-/+ resource "azurerm_role_assignment" "project_acrpull" {
      ~ id                               = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.Authorization/roleAssignments/6df78ab6-5bf1-201d-c588-1a1779d22985" -> (known after apply)
      ~ name                             = "6df78ab6-5bf1-201d-c588-1a1779d22985" -> (known after apply)
      ~ principal_id                     = "ebd84b84-d1d9-496d-9b29-95068ba77163" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> (known after apply)
      ~ scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.kubernetes[1].azurerm_role_assignment.service_operator[0] must be replaced
-/+ resource "azurerm_role_assignment" "service_operator" {
      ~ id                               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleAssignments/ddff5078-4065-64b8-5904-f09551598a48" -> (known after apply)
      ~ name                             = "ddff5078-4065-64b8-5904-f09551598a48" -> (known after apply)
      ~ principal_id                     = "ff47ab8f-e4d9-48f2-ad31-af5933824849" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      ~ scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.kubernetes[1].azurerm_role_assignment.uami_rg_identity_operator[0] must be replaced
-/+ resource "azurerm_role_assignment" "uami_rg_identity_operator" {
      ~ id                               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/managed-identities-sbox-rg/providers/Microsoft.Authorization/roleAssignments/fda0c34d-18d2-b188-eac3-792738655897" -> (known after apply)
      ~ name                             = "fda0c34d-18d2-b188-eac3-792738655897" -> (known after apply)
      ~ principal_id                     = "ebd84b84-d1d9-496d-9b29-95068ba77163" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleDefinitions/f1a07417-d97a-45cb-824c-7a7467783830" -> (known after apply)
      ~ scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/managed-identities-sbox-rg" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.kubernetes[1].azurerm_role_assignment.update_checker[0] must be replaced
-/+ resource "azurerm_role_assignment" "update_checker" {
      ~ id                               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-01-aks/providers/Microsoft.Authorization/roleAssignments/fba3addd-2170-0f24-fb70-638326e3538b" -> (known after apply)
      ~ name                             = "fba3addd-2170-0f24-fb70-638326e3538b" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      ~ scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/cft-sbox-01-aks" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 11 to add, 2 to change, 11 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":354,"Program":"tfcmt","SHA1":"","Target":"sbox-aks","Vars":{}} -->